In [ ]:
# installing required libraries
!pip install bs4
!pip install requests

# Question 1 Answer --> program to display all the header tags from wikipedia.org

In [2]:
# importing required libraries
from bs4 import BeautifulSoup
import requests

In [3]:
# getting url
page = requests.get("https://en.wikipedia.org/wiki/Main_Page")

In [ ]:
# successful response code
page

In [ ]:
# Scraping webpage

soup = BeautifulSoup(page.content)
soup

In [6]:
header_tags = []     # empty list for storing the data

In [7]:
# Displaying and storing scraped header_tags data in list

for i in soup.find_all(['h1','h2','h3']):
    header_tags.append(i.text)
    
header_tags

['Main Page',
 'Welcome to Wikipedia',
 "From today's featured article",
 'Did you know\xa0...',
 'In the news',
 'On this day',
 "Today's featured picture",
 'Other areas of Wikipedia',
 "Wikipedia's sister projects",
 'Wikipedia languages',
 'Navigation menu',
 '\nSearch\n']

# Question 2 Answer --> program to display IMDB’s Top rated 100 movies’ data (i.e. name, rating, year of release) and make data frame.

In [8]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
imdbpage = requests.get("https://www.imdb.com/chart/top/")
imdbpage

In [ ]:
# Scraping webpage

soup2 = BeautifulSoup(imdbpage.content)
soup2

In [ ]:
movieframe = soup2.find_all("tbody", class_="lister-list")
movieframe        #creating a sublist for name extraction purpose since there are a lot of "a" tags other than movie names present in the code 
                  #which would cause all those iterations to enter the list which would be difficult to remove

In [ ]:
rating = []   # creating empty list to store the data

for i in soup2.find_all('strong'):
    rating.append(i.text)
    
rating         # 250 movie ratings stored which we will filter to 100 after creating data frame

In [ ]:
len(rating)  # after creating data frame we will filter till 100 movies

In [ ]:
names = []        # creating empty list to store the data

for i in movieframe[0].find_all('a'):          #even inside movie frame ' \n' comes cause 'a' tag
    names.append(i.text)
    
names

In [ ]:
for i in names:           
    names.remove(' \n')     # removing the excess ' \n' from the list
    
names

In [ ]:
len(names)

In [ ]:
year = []               # creating empty list to store the data
 
for i in soup2.find_all('span',class_="secondaryInfo"):
    year.append(i.text.replace(")",'').replace("(",''))   #replacing '()' in the year in the iteration itself
   
year

In [ ]:
len(year)

In [ ]:
imdb250 = pd.DataFrame({'Names':names,'Ratings':rating,'year of release':year,})      #imdb top 250 movies data frame
imdb250

In [20]:
imdbtop100 = imdb250.iloc[0:100,:]         # filtered to top 100

In [21]:
imdbtop100                                 # final DataFrame answer

                                Names Ratings year of release
0            The Shawshank Redemption     9.2            1994
1                       The Godfather     9.2            1972
2                     The Dark Knight     9.0            2008
3              The Godfather: Part II     9.0            1974
4                        12 Angry Men     8.9            1957
..                                ...     ...             ...
95            Spider-Man: No Way Home     8.3            2021
96  M - Eine Stadt sucht einen Mörder     8.3            1931
97                 North by Northwest     8.3            1959
98                             Jagten     8.3            2012
99                            Vertigo     8.2            1958

[100 rows x 3 columns]

# Question 3 Answer --> program to display IMDB’s Top rated 100 Indian movies’ data (i.e. name, rating, year of release) and made data frame.

In [22]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
imdbindian=requests.get("https://www.imdb.com/india/top-rated-indian-movies/")
imdbindian

In [ ]:
# Scraping webpage

soup3 = BeautifulSoup(imdbindian.content)
soup3

In [ ]:
moviebody = soup3.find_all("tbody", class_="lister-list")
moviebody    #creating a sublist for name extraction purpose since there are a lot of "a" tags other than movie names present in the code 
             #which would cause all those iterations to enter the list which would be difficult to remove

In [ ]:
names1 = []                      # creating empty list to store the data

for i in moviebody[0].find_all('a'):       #even inside movie frame ' \n' comes cause 'a' tag
    names1.append(i.text)
    
names1

In [ ]:
for i in names1:
    names1.remove(' \n')             # removing the excess ' \n' from the list
    
names1

In [ ]:
len(names1)              # 250 movie ratings stored which we will filter to 100 after creating data frame

In [ ]:
rating1 = []              # creating empty list to store the data

for i in soup3.find_all('strong'):
    rating1.append(i.text)
    
rating1

In [30]:
len(rating1)

250

In [ ]:
year1 = []                   # creating empty list to store the data

for i in soup3.find_all('span',class_="secondaryInfo"):
    year1.append(i.text.replace(")",'').replace("(",''))         #replacing '()' in the year in the iteration itself
   
year1

In [32]:
len(year1)

250

In [ ]:
imdb250indian = pd.DataFrame({'Names':names1,'Ratings':rating1,'year of release':year1})    #imdb top 250 Indian movies data frame
imdb250indian

In [34]:
imdbtop100indian = imdb250indian.iloc[0:100,:]         # filtered to top 100 Indian movies

In [35]:
imdbtop100indian                                       # final DataFrame answer

                      Names Ratings year of release
0                  Jai Bhim     8.4            2021
1                Anbe Sivam     8.4            2003
2                   Golmaal     8.4            1979
3          K.G.F: Chapter 2     8.4            2022
4                   Nayakan     8.4            1987
..                      ...     ...             ...
95                   Baasha     8.0            1995
96                   Masaan     8.0            2015
97           Dil Chahta Hai     8.0            2001
98                  Kahaani     8.0            2012
99  Maheshinte Prathikaaram     8.0            2016

[100 rows x 3 columns]

# Question 4 Answer --> program to scrape product name, price and discounts from https://meesho.com/bags-ladies/pl/p7vbp

In [36]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
meesho=requests.get("https://meesho.com/bags-ladies/pl/p7vbp")
meesho

In [ ]:
# Scraping webpage

soup4 = BeautifulSoup(meesho.content)
soup4

In [ ]:
productdata = soup4.find_all('div',class_="sc-gsDKAQ Grid__Row-sc-4ki5nk-0 iQiJjX gfsqfL products")
productdata

In [ ]:
productname = []              # creating empty list to store the data

for i in productdata[0].find_all('p',class_="Text__StyledText-sc-oo0kvp-0 bWSOET NewProductCard__ProductTitle_Desktop-sc-j0e7tu-4 cQhePS NewProductCard__ProductTitle_Desktop-sc-j0e7tu-4 cQhePS"):
    productname.append(i.text)
    
productname

In [ ]:
price = []              # creating empty list to store the data

for i in productdata[0].find_all('p',class_="Text__StyledText-sc-oo0kvp-0 hpXvds Paragraph__StyledParagraphBody2StrikeThrough-sc-69qp0d-0 hEkmRy Paragraph__StyledParagraphBody2StrikeThrough-sc-69qp0d-0 hEkmRy"):
    price.append(i.text)
    
price

In [ ]:
discounts = []              # creating empty list to store the data

for i in productdata[0].find_all('span',class_="Text__StyledText-sc-oo0kvp-0 lnonyH"):
    discounts.append(i.text)
    
discounts

In [ ]:
# printing length
print(len(productname),len(price),len(discounts))

In [44]:
#making data frame

meeshodetails = pd.DataFrame({'Product Name':productname,'Price':price,'Discounts':discounts})
meeshodetails

                            Product Name  Price Discounts
0          Graceful Fancy Women Handbags   ₹578    9% off
1        Ravishing Classy Women Handbags  ₹1000    5% off
2       Classic Versatile Women Handbags  ₹1000    5% off
3           Voguish Fancy Women Handbags  ₹1599    3% off
4      Ravishing Alluring Women Handbags   ₹434   12% off
5      Graceful Versatile Women Handbags  ₹1000    5% off
6         Classic Stylish Women Handbags  ₹3252    2% off
7   Ravishing Fashionable Women Handbags   ₹366   14% off
8          Elegant Classy Women Handbags  ₹1000    5% off
9        Elegant Alluring Women Handbags  ₹2387    2% off
10       Classic Alluring Women Handbags   ₹568    9% off
11    Elegant Fashionable Women Handbags   ₹775    6% off
12        Trendy Alluring Women Handbags  ₹1370    4% off
13        Trendy Alluring Women Handbags  ₹1000    5% off
14          Classic Fancy Women Handbags   ₹696    7% off
15    Classic Fashionable Women Handbags   ₹670    7% off

# Question 5 Answer -->

# Question Number 5 (a) Top 10 ODI teams in men’s cricket along with the records for matches, points and rating.

In [45]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
mensoditeam=requests.get("https://www.icc-cricket.com/rankings/mens/team-rankings/odi")
mensoditeam

In [ ]:
# Scraping webpage

soup5 = BeautifulSoup(mensoditeam.content)
soup5

In [ ]:
table = soup5.find_all('table',class_="table")
table                                     #spliting it into only necessary elements list

In [ ]:
teamnames = []

for i in table[0].find_all('span',class_="u-show-phablet"):
    teamnames.append(i.text)
    
teamnames        # will filter all names, matches, points and rating together to top 10 at the end after creating data frame

In [ ]:
matches1 = [table[0].find('td',class_="rankings-block__banner--matches").text] 
matches1    # since the first newzealand team has a different class than the rest of 2-10 teams classes but with same 'td' tag

In [ ]:
points1 = [table[0].find('td',class_="rankings-block__banner--points").text] 
points1     # since the first newzealand team has a different class than the rest of 2-10 teams classes but with same 'td' tag

In [ ]:
matches = []

for i in table[0].find_all('td',class_="table-body__cell u-center-text"):
    matches.append(i.text)
    
matches  # both the matches and points are having the same tag and the same class name hence both come together when iterated

In [ ]:
points2 = [matches[i] for i in range(len(matches)) if i % 2 != 0]
points2                  # from 2 - 20 teams points

In [ ]:
matches2 = matches[0::2]
matches2                # from 2 - 20 teams matches

In [ ]:
matchesfinal= matches1 + matches2
matchesfinal              # teams 1 - 20 final matches

In [ ]:
pointsfinal= points1 + points2
pointsfinal       # teams 1 - 20 final points

In [ ]:
ratings1 = [table[0].find('td',class_="rankings-block__banner--rating u-text-right").text.replace('\n                            ','').replace('\n                            \n\n','').replace('\n\n','')]     
ratings1    # since the first newzealand team has a different class than the rest of 2-10 teams classes but with same 'td' tag

In [ ]:
ratings2 = []

for i in table[0].find_all('td',class_="table-body__cell u-text-right rating"):
    ratings2.append(i.text)

ratings2     # from 2 - 20 teams ratings

In [ ]:
ratings = ratings1 + ratings2
ratings                           # teams 1 - 20 final ratings

In [ ]:
# printing length
print(len(teamnames),len(matchesfinal),len(pointsfinal),len(ratings))

In [ ]:
# Making dataframe

top20mensoditeam = pd.DataFrame({'Team Names':teamnames,'Matches':matchesfinal,'Points':pointsfinal,'Ratings':ratings})
top20mensoditeam                 # top 20 teams

In [62]:
top10mensoditeam = top20mensoditeam.iloc[0:10,:]         # filtered to top 10 mens odi team
top10mensoditeam

  Team Names Matches Points Ratings
0         NZ      20  2,448     122
1        ENG      32  3,793     119
2        AUS      31  3,475     112
3        IND      38  4,162     110
4         SA      31  3,167     102
5        PAK      30  2,921      97
6        BAN      36  3,350      93
7         SL      35  2,835      81
8         WI      36  2,788      77
9        AFG      23  1,562      68

# Question 5 b) Answer Top 10 ODI Batsmen along with the records of their team and rating.

In [63]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
odibatsmen = requests.get("https://www.icc-cricket.com/rankings/mens/player-rankings/odi")
odibatsmen

In [ ]:
# Scraping webpage

soup6 = BeautifulSoup(odibatsmen.content)
soup6

In [ ]:
table6 = soup6.find_all('div',class_="rankings-block__container")
table6                                     #spliting it into only necessary elements list

In [ ]:
batsmennames1 = [table6[0].find('div',class_="rankings-block__banner--name").text]
    
batsmennames1       # 1st batsmen seperately since classes of the rest are different

In [ ]:
batsmennames2 = []

for i in table6[0].find_all('td',class_="table-body__cell name"):
    batsmennames2.append(i.text.replace('\n',''))
    
batsmennames2

In [ ]:
batsmennames = batsmennames1 + batsmennames2
batsmennames

In [ ]:
teamnamesa = []

for i in table6[0].find_all('div',class_="rankings-block__banner--nationality"):
    teamnamesa.append(i.text.replace('\n','').replace('                            891',''))

teamnamesa

In [ ]:
teamnamesb = []

for i in table6[0].find_all('span',class_="table-body__logo-text"):
    teamnamesb.append(i.text)

teamnamesb

In [ ]:
teamnamesc = teamnamesa + teamnamesb
teamnamesc

In [ ]:
ratingsa = []

for i in table6[0].find_all('div',class_="rankings-block__banner--rating"):
    ratingsa.append(i.text)

ratingsa

In [ ]:
ratingsb = []

for i in table6[0].find_all('td',class_="table-body__cell u-text-right rating"):
    ratingsb.append(i.text)

ratingsb

In [ ]:
ratingsc = ratingsa + ratingsb
ratingsc

In [ ]:
# printing length
print(len(batsmennames),len(teamnamesc),len(ratingsc))

In [77]:
# Making dataframe

top10mensodibatsmen = pd.DataFrame({'Batsmen Names':batsmennames,'Teamnames':teamnamesc,'Ratings':ratingsc})
top10mensodibatsmen                # top 10 ODI Batsmen along with team names and Ratings

           Batsmen Names Teamnames Ratings
0             Babar Azam       PAK     891
1            Virat Kohli       IND     811
2            Imam-ul-Haq       PAK     795
3           Rohit Sharma       IND     791
4        Quinton de Kock        SA     789
5         Jonny Bairstow       ENG     775
6            Ross Taylor        NZ     775
7  Rassie van der Dussen        SA     769
8           David Warner       AUS     750
9            Aaron Finch       AUS     745

# Question 5 c) Answer Top 10 ODI bowlers along with the records of their team and ratings

In [78]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [79]:
# getting url
odibowlers = requests.get("https://www.icc-cricket.com/rankings/mens/player-rankings/odi")
odibowlers

In [ ]:
# Scraping webpage

soup7 = BeautifulSoup(odibowlers.content)
soup7

In [ ]:
table7 = soup7.find_all('div',class_="col-4 col-12-desk touch-scroll-list__element")
table7                                     #spliting it into only necessary elements list

In [ ]:
bowlernames1 = [table7[-2].find('div',class_="rankings-block__banner--name").text]
    
bowlernames1       # 1st bowler seperately since classes of the rest are different

In [ ]:
teamnamesd = [table7[-2].find('div',class_="rankings-block__banner--nationality").text.replace('\n','').replace('                            726','')]
    
teamnamesd      # 1st bowler team seperately since classes of the rest are different

In [ ]:
ratingsd = [table7[-2].find('div',class_="rankings-block__banner--nationality").text.replace('\n','').replace('NZ                            ','')]
    
ratingsd      # 1st bowler team seperately since classes of the rest are different

In [ ]:
bowlernames2 = []

for i in table7[-2].find_all('td',class_="table-body__cell name"):
    bowlernames2.append(i.text.replace('\n',''))
    
bowlernames2

In [ ]:
bowlernames = bowlernames1 + bowlernames2
bowlernames            # total top 10

In [ ]:
teamnamese = []

for i in table7[-2].find_all('span',class_="table-body__logo-text"):
    teamnamese.append(i.text)
    
teamnamese

In [ ]:
teamnamesf = teamnamesd + teamnamese
teamnamesf              # total top 10

In [ ]:
ratingse = []

for i in table7[-2].find_all('td',class_="table-body__cell u-text-right rating"):
    ratingse.append(i.text)
    
ratingse

In [ ]:
ratingsf = ratingsd + ratingse
ratingsf               # total top 10

In [ ]:
# printing length
print(len(batsmennames),len(teamnamesc),len(ratingsc))

In [92]:
# Making dataframe

top10mensodibowlers = pd.DataFrame({'Bowler Names':bowlernames,'Teamnames':teamnamesf,'Ratings':ratingsf})
top10mensodibowlers               # top 10 ODI bowlers along with team names and Ratings

       Bowler Names Teamnames Ratings
0       Trent Boult        NZ     726
1      Chris Woakes       ENG     700
2    Josh Hazlewood       AUS     698
3        Matt Henry        NZ     683
4  Mujeeb Ur Rahman       AFG     681
5    Jasprit Bumrah       IND     679
6    Shaheen Afridi       PAK     671
7      Mehedi Hasan       BAN     661
8   Shakib Al Hasan       BAN     657
9       Rashid Khan       AFG     650

# Question 6 Answer -->

# Question Number 6 (a) Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.

In [93]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
womenoditeam = requests.get("https://www.icc-cricket.com/rankings/womens/team-rankings/odi")
womenoditeam

In [ ]:
# Scraping webpage

soup8 = BeautifulSoup(womenoditeam.content)
soup8

In [ ]:
table8 = soup8.find_all('table',class_="table")
table8                                     #spliting it into only necessary elements list

In [ ]:
womenmatches1 = [table8[0].find('td',class_="rankings-block__banner--matches").text]

womenmatches1   # 1st womens matches seperately since classes of the rest are different

In [ ]:
womenpoints1 = [table8[0].find('td',class_="rankings-block__banner--points").text]

womenpoints1   # 1st womens points seperately since classes of the rest are different

In [ ]:
womenratings1 = [table8[0].find('td',class_="rankings-block__banner--rating u-text-right").text.replace('\n','').replace('                            ','')]

womenratings1   # 1st womens ratings seperately since classes of the rest are different

In [ ]:
womenteamnames = []

for i in table8[0].find_all('span',class_="u-hide-phablet"):
    womenteamnames.append(i.text)
    
womenteamnames               # total team names

In [ ]:
womenmixed = []

for i in table8[0].find_all('td',class_="table-body__cell u-center-text"):
    womenmixed.append(i.text)
    
womenmixed

In [ ]:
womenmatches2 = womenmixed[0::2]
womenmatches2

In [ ]:
womenpoints2 = womenmixed[1::2]
womenpoints2

In [ ]:
womenratings2 = []

for i in table8[0].find_all('td',class_="table-body__cell u-text-right rating"):
    womenratings2.append(i.text)
    
womenratings2

In [ ]:
womenmatches = womenmatches1 + womenmatches2
womenmatches

In [ ]:
womenpoints = womenpoints1 + womenpoints2
womenpoints

In [ ]:
womenratings = womenratings1 + womenratings2
womenratings

In [ ]:
# printing length
print(len(womenteamnames),len(womenmatches),len(womenpoints),len(womenratings))

In [ ]:
# Making dataframe

top11womensoditeams = pd.DataFrame({'Team Names':womenteamnames,'Matches':womenmatches,'Points':womenpoints,'Ratings':womenratings})
top11womensoditeams               # Top 11 ODI teams in women’s cricket along with the records for matches, points and rating

In [110]:
top10womensoditeams = top11womensoditeams.iloc[0:10,:] 
top10womensoditeams# Final Top 10 ODI teams in women’s cricket along with the records for matches, points and rating

     Team Names Matches Points Ratings
0     Australia      29  4,840     167
1  South Africa      28  3,504     125
2       England      30  3,533     118
3         India      29  2,878      99
4   New Zealand      31  3,030      98
5   West Indies      28  2,481      89
6    Bangladesh      12    936      78
7      Pakistan      26  1,752      67
8       Ireland       5    240      48
9     Sri Lanka       5    233      47

# Question Number 6 (b) Top 10 women’s ODI Batting players along with the records of their team and ratings.

In [111]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
womenodibatting = requests.get("https://www.icc-cricket.com/rankings/womens/player-rankings/odi")
womenodibatting

In [ ]:
# Scraping webpage

soup9 = BeautifulSoup(womenodibatting.content)
soup9

In [ ]:
table9 = soup9.find_all('div',class_="rankings-block__container")
table9                                     #spliting it into only necessary elements list

In [ ]:
namesg = [table9[0].find('div',class_="rankings-block__banner--name").text]

namesg   # 1st womens names seperately since classes of the rest are different

In [ ]:
teamsg = [table9[0].find('div',class_="rankings-block__banner--nationality").text.replace('\n','').replace('                            785','')]

teamsg   # 1st womens team seperately since classes of the rest are different

In [ ]:
ratingsg = [table9[0].find('div',class_="rankings-block__banner--nationality").text.replace('\n','').replace('AUS                            ','')]

ratingsg   # 1st womens team seperately since classes of the rest are different

In [ ]:
namesh = []

for i in table9[0].find_all('td',class_="table-body__cell name"):
    namesh.append(i.text.replace('\n',''))
    
namesh

In [ ]:
teamsh = []

for i in table9[0].find_all('span',class_="table-body__logo-text"):
    teamsh.append(i.text)
    
teamsh

In [ ]:
ratingsh = []

for i in table9[0].find_all('td',class_="table-body__cell u-text-right rating"):
    ratingsh.append(i.text)
    
ratingsh

In [ ]:
namesi = namesg + namesh
namesi

In [ ]:
teamsi = teamsg + teamsh
teamsi

In [ ]:
ratingsi = ratingsg + ratingsh
ratingsi

In [ ]:
print(len(namesi),len(teamsi),len(ratingsi))

In [125]:
#making dataFrame

top10womensodibatting = pd.DataFrame({'Womens Batting Players':namesi,'Team Names':teamsi,'Ratings':ratingsi})
top10womensodibatting   # Top 10 women’s ODI Batting players along with the records of their team and ratings.

  Womens Batting Players Team Names Ratings
0           Alyssa Healy        AUS     785
1         Natalie Sciver        ENG     750
2            Beth Mooney        AUS     748
3        Laura Wolvaardt         SA     722
4            Meg Lanning        AUS     710
5         Rachael Haynes        AUS     701
6            Mithali Raj        IND     686
7      Amy Satterthwaite         NZ     681
8        Smriti Mandhana        IND     669
9         Tammy Beaumont        ENG     659

# Question Number 6 (c) Top 10 women’s ODI all-rounder along with the records of their team and ratings.

In [126]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
womenodiallrounder = requests.get("https://www.icc-cricket.com/rankings/womens/player-rankings/odi")
womenodiallrounder

In [ ]:
# Scraping webpage

soup10 = BeautifulSoup(womenodiallrounder.content)
soup10

In [ ]:
table10 = soup10.find_all('div',class_="rankings-block__container")
table10                                     #spliting it into only necessary elements list

In [ ]:
namesj = [table10[-1].find('div',class_="rankings-block__banner--name").text]

namesj   # 1st womens allrounder names seperately since classes of the rest are different

In [ ]:
teamsj = [table10[-1].find('div',class_="rankings-block__banner--nationality").text.replace('\n','').replace('                            393','')]

teamsj   # 1st womens names seperately since classes of the rest are different

In [ ]:
ratingj = [table10[-1].find('div',class_="rankings-block__banner--rating").text]

ratingj   # 1st womens names seperately since classes of the rest are different

In [ ]:
namesk = []

for i in table10[-1].find_all('td',class_="table-body__cell name"):
    namesk.append(i.text.replace('\n',''))
    
namesk

In [ ]:
teamsk = []

for i in table10[-1].find_all('span',class_="table-body__logo-text"):
    teamsk.append(i.text.replace('\n',''))
    
teamsk

In [ ]:
ratingk = []

for i in table10[-1].find_all('td',class_="table-body__cell u-text-right rating"):
    ratingk.append(i.text)
    
ratingk

In [ ]:
namesl = namesj + namesk
namesl       # top 10 names

In [ ]:
teamsl = teamsj + teamsk
teamsl       # top 10 teams

In [ ]:
ratingl = ratingj + ratingk
ratingl       # top 10 rating

In [ ]:
print(len(namesl),len(teamsl),len(ratingl))

In [140]:
#making dataFrame

top10womensodiallrounder = pd.DataFrame({'Womens All Rounder Players':namesl,'Team Names':teamsl,'Ratings':ratingl})
top10womensodiallrounder   # Top 10 women’s ODI Batting players along with the records of their team and ratings.

  Womens All Rounder Players Team Names Ratings
0             Natalie Sciver        ENG     393
1               Ellyse Perry        AUS     374
2             Marizanne Kapp         SA     359
3            Hayley Matthews         WI     338
4                Amelia Kerr         NZ     335
5           Ashleigh Gardner        AUS     269
6              Deepti Sharma        IND     249
7              Jess Jonassen        AUS     245
8            Katherine Brunt        ENG     221
9             Jhulan Goswami        IND     217

# Question 7 Answer --> heading, date, content and the link for the youtube video from the post from coreyMS

In [7]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
coreyms = requests.get("https://coreyms.com/")
coreyms

In [ ]:
# Scraping webpage

soup11 = BeautifulSoup(coreyms.content)
soup11

In [ ]:
table11 = soup11.find_all('main',class_="content")
table11                                     #spliting it into only necessary elements list

In [11]:
heading = []

for i in table11[0].find_all('a',class_="entry-title-link"):
    heading.append(i.text)
    
heading          # the headings from the post

['Python Tutorial: Zip Files – Creating and Extracting Zip Archives',
 'Python Data Science Tutorial: Analyzing the 2019 Stack Overflow Developer Survey',
 'Python Multiprocessing Tutorial: Run Code in Parallel Using the Multiprocessing Module',
 'Python Threading Tutorial: Run Code Concurrently Using the Threading Module',
 'Update (2019-09-03)',
 'Python Quick Tip: The Difference Between “==” and “is” (Equality vs Identity)',
 'Python Tutorial: Calling External Commands Using the Subprocess Module',
 'Visual Studio Code (Windows) – Setting up a Python Development Environment and Complete Overview',
 'Visual Studio Code (Mac) – Setting up a Python Development Environment and Complete Overview',
 'Clarifying the Issues with Mutable Default Arguments']

In [6]:
date = []

for i in table11[0].find_all('time',class_="entry-time"):
    date.append(i.text)
    
date         # the dates from the post

['November 19, 2019',
 'October 17, 2019',
 'September 21, 2019',
 'September 12, 2019',
 'September 3, 2019',
 'August 6, 2019',
 'July 24, 2019',
 'May 1, 2019',
 'May 1, 2019',
 'April 24, 2019']

In [147]:
content = []

for i in table11[0].find_all('div',class_="entry-content"):
    content.append(i.text.replace('\n',''))
    
content        # the contents from the post

['In this video, we will be learning how to create and extract zip archives. We will start by using the zipfile module, and then we will see how to do this using the shutil module. We will learn how to do this with single files and directories, as well as learning how to use gzip as well. Let’s get started…',
 'In this Python Programming video, we will be learning how to download and analyze real-world data from the 2019 Stack Overflow Developer Survey. This is terrific practice for anyone getting into the data science field. We will learn different ways to analyze this data and also some best practices. Let’s get started…',
 'In this Python Programming video, we will be learning how to run code in parallel using the multiprocessing module. We will also look at how to process multiple high-resolution images at the same time using a ProcessPoolExecutor from the concurrent.futures module. Let’s get started…',
 'In this Python Programming video, we will be learning how to run threads concurrently using the threading module. We will also look at how to download multiple high-resolution images online using a ThreadPoolExecutor from the concurrent.futures module. Let’s get started…',
 'Hey everyone. I wanted to give you an update on my videos. I will be releasing videos on threading and multiprocessing within the next week. Thanks so much for your patience. I currently have a temporary recording studio setup at my Airbnb that will allow me to record and edit the threading/multiprocessing videos. I am going to be moving into my new house in 10 days and once I have my recording studio setup then you can expect much faster video releases. I really appreciate how patient everyone has been while I go through this move, especially those of you who are contributing monthly through YouTube ',
 'In this Python Programming Tutorial, we will be learning the difference between using “==” and the “is” keyword when doing comparisons. The difference between these is that “==” checks to see if values are equal, and the “is” keyword checks their identity, which means it’s going to check if the values are identical in terms of being the same object in memory. We’ll learn more in the video. Let’s get started…',
 'In this Python Programming Tutorial, we will be learning how to run external commands using the subprocess module from the standard library. We will learn how to run commands, capture the output, handle errors, and also how to pipe output into other commands. Let’s get started…',
 'In this Python Programming Tutorial, we will be learning how to set up a Python development environment in VSCode on Windows. VSCode is a very nice free editor for writing Python applications and many developers are now switching over to this editor. In this video, we will learn how to install VSCode, get the Python extension installed, how to change Python interpreters, create virtual environments, format/lint our code, how to use Git within VSCode, how to debug our programs, how unit testing works, and more. We have a lot to cover, so let’s go ahead and get started…VSCode on MacOS – https://youtu.be/06I63_p-2A4Timestamps for topics in this tutorial: Installation – 1:13 Python Extension – 5:48 Switching Interpreters – 10:04 Changing Color Themes – 12:35 VSCode Settings – 16:16 Set Default Python – 21:33 Using Virtual Environments – 25:10 IntelliSense – 29:45 Code Formatting – 32:13 Code Linting – 37:06 Code Runner Extension – 39:42 Git Integration – 47:44 Use Different Terminal – 51:07 Debugging – 58:45 Unit Testing – 1:03:25 Zen Mode – 1:09:55',
 'In this Python Programming Tutorial, we will be learning how to set up a Python development environment in VSCode on MacOS. VSCode is a very nice free editor for writing Python applications and many developers are now switching over to this editor. In this video, we will learn how to install VSCode, get the Python extension installed, how to change Python interpreters, create virtual environments, format/lint our code, how to use Git within VSCode, how to debug our programs, how unit testing works, and more. We have a lot to cover, so let’s go ahead and get started…VSCode on Windows – https://youtu.be/-nh9rCzPJ20Timestamps for topics in this tutorial: Installation – 1:11 Python Extension – 6:21 Switching Interpreters – 10:16 Changing Color Themes – 13:08 VSCode Settings – 17:12 Set Default Python – 22:24 Using Virtual Environments – 25:52 IntelliSense – 30:28 Code Formatting – 33:08 Code Linting – 38:01 Code Runner Extension – 40:45 Git Integration – 49:05 Debugging – 58:15 Unit Testing – 1:02:38 Zen Mode – 1:10:42 ',
 'In this Python Programming Tutorial, we will be clarifying the issues with mutable default arguments. We discussed this in my last video titled “5 Common Python Mistakes and How to Fix Them”, but I received many comments from people who were still confused. So we will be doing a deeper dive to explain exactly what is going on here. Let’s get started…']

In [148]:
code = []

for i in table11[0].find_all('iframe',class_="youtube-player"):
    code.append(i)
    
code       # codes for the video from the link for the youtube video from the post

[<iframe allowfullscreen="true" class="youtube-player" height="360" sandbox="allow-scripts allow-same-origin allow-popups allow-presentation" src="https://www.youtube.com/embed/z0gguhEmWiY?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent" style="border:0;" width="640"></iframe>,
 <iframe allowfullscreen="true" class="youtube-player" height="360" sandbox="allow-scripts allow-same-origin allow-popups allow-presentation" src="https://www.youtube.com/embed/_P7X8tMplsw?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent" style="border:0;" width="640"></iframe>,
 <iframe allowfullscreen="true" class="youtube-player" height="360" sandbox="allow-scripts allow-same-origin allow-popups allow-presentation" src="https://www.youtube.com/embed/fKl2JW_qrso?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent" style="border:0;" width="640"></iframe>,
 <iframe allowfullscreen="true" class="youtube-player" height="360" sandbox="allow-scripts allow-same-origin allow-popups allow-presentation" src="https://www.youtube.com/embed/IEEhzQoKtQU?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent" style="border:0;" width="640"></iframe>,
 <iframe allowfullscreen="true" class="youtube-player" height="360" sandbox="allow-scripts allow-same-origin allow-popups allow-presentation" src="https://www.youtube.com/embed/mO_dS3rXDIs?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent" style="border:0;" width="640"></iframe>,
 <iframe allowfullscreen="true" class="youtube-player" height="360" sandbox="allow-scripts allow-same-origin allow-popups allow-presentation" src="https://www.youtube.com/embed/2Fp1N6dof0Y?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent" style="border:0;" width="640"></iframe>,
 <iframe allowfullscreen="true" class="youtube-player" height="360" sandbox="allow-scripts allow-same-origin allow-popups allow-presentation" src="https://www.youtube.com/embed/-nh9rCzPJ20?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent" style="border:0;" width="640"></iframe>,
 <iframe allowfullscreen="true" class="youtube-player" height="360" sandbox="allow-scripts allow-same-origin allow-popups allow-presentation" src="https://www.youtube.com/embed/06I63_p-2A4?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent" style="border:0;" width="640"></iframe>,
 <iframe allowfullscreen="true" class="youtube-player" height="360" sandbox="allow-scripts allow-same-origin allow-popups allow-presentation" src="https://www.youtube.com/embed/_JGmemuINww?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent" style="border:0;" width="640"></iframe>]

In [149]:
url = []

for i in table11[0].find_all('iframe',class_="youtube-player"):
    url.append(i['src'])
    
url       # the url from the above code for the video from the post

['https://www.youtube.com/embed/z0gguhEmWiY?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent',
 'https://www.youtube.com/embed/_P7X8tMplsw?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent',
 'https://www.youtube.com/embed/fKl2JW_qrso?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent',
 'https://www.youtube.com/embed/IEEhzQoKtQU?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent',
 'https://www.youtube.com/embed/mO_dS3rXDIs?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent',
 'https://www.youtube.com/embed/2Fp1N6dof0Y?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent',
 'https://www.youtube.com/embed/-nh9rCzPJ20?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent',
 'https://www.youtube.com/embed/06I63_p-2A4?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent',
 'https://www.youtube.com/embed/_JGmemuINww?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent']

# Question 8 Answer ---> scraping house details such as house title, location, area, EMI and price from https://www.nobroker.in/ .Enter three localities which are Indira Nagar, Jayanagar, Rajaji Nagar.

In [150]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
nobroker = requests.get("https://www.nobroker.in/property/sale/bangalore/multiple?searchParam=W3sibGF0IjoxMi45NzgzNjkyLCJsb24iOjc3LjY0MDgzNTYsInBsYWNlSWQiOiJDaElKa1FOM0dLUVdyanNSTmhCUUpyaEdEN1UiLCJwbGFjZU5hbWUiOiJJbmRpcmFuYWdhciJ9LHsibGF0IjoxMi45MzA3NzM1LCJsb24iOjc3LjU4MzgzMDIsInBsYWNlSWQiOiJDaElKMmRkbFo1Z1ZyanNSaDFCT0FhZi1vcnMiLCJwbGFjZU5hbWUiOiJKYXlhbmFnYXIifSx7ImxhdCI6MTIuOTk4MTczMiwibG9uIjo3Ny41NTMwNDQ1OTk5OTk5OSwicGxhY2VJZCI6IkNoSUp4Zlc0RFBNOXJqc1JLc05URy01cF9RUSIsInBsYWNlTmFtZSI6IlJhamFqaW5hZ2FyIn1d&radius=2.0&city=bangalore&locality=Indiranagar,&locality=Jayanagar,&locality=Rajajinagar")
nobroker

In [ ]:
# Scraping webpage
soup12 = BeautifulSoup(nobroker.content)
soup12

In [ ]:
table12 = soup12.find_all('div',class_="infinite-scroll-component__outerdiv")
table12                                     #spliting it into only necessary elements list

In [ ]:
housetitle = []

for i in table12[0].find_all('span',class_="overflow-hidden overflow-ellipsis whitespace-nowrap max-w-80pe po:max-w-full"):
    housetitle.append(i.text)
    
housetitle          # the housetitles

In [ ]:
location = []

for i in table12[0].find_all('div',class_="mt-0.5p overflow-hidden overflow-ellipsis whitespace-nowrap max-w-70 text-gray-light leading-4 po:mb-0 po:max-w-95"):
    location.append(i.text)
    
location         # the locations

In [ ]:
mix = []

for i in table12[0].find_all('div',class_="font-semi-bold heading-6"):
    mix.append(i.text)
    
mix        # the built up sq ft area, EMI and price together since tag 'div' and class_="flex" were giving too many irrelevant elements which would be hard to filter

In [ ]:
area = mix[0::3]
area    # the built up sq ft area

In [ ]:
emi = mix[1::3]
emi    # the estimated emi per month

In [ ]:
price = mix[2::3]
price   # the total price

In [ ]:
print(len(housetitle),len(location),len(area),len(emi),len(price))

In [161]:
#making data frame

nobrokerdetails = pd.DataFrame({'House Title':housetitle,'Location':location,'Sq Ft Area':area,'EMI per month':emi,'Total Price':price})
nobrokerdetails

,House Title,Location,Sq Ft Area,EMI per month,Total Price
0,4+ BHK In Independent House For Sale In Raja...,"Independent House, 5th Block, near National Pu...","3,000 sqft",₹1.86 Lacs/Month,₹3.25 Crores
1,4 BHK In Independent House For Sale In Jayan...,"Independent House, Jayanagar SBI Branch 9th bl...","2,500 sqft",₹1.55 Lacs/Month,₹2.7 Crores
2,3 BHK Flat For Sale In Shree Rameshwara Nila...,manjunath road near The illusion Cafe,"1,200 sqft","₹63,045/Month",₹1.1 Crores
3,4+ BHK In Independent House For Sale In Raja...,"Independent House, 6th Cross road,9th main ro...","1,320 sqft","₹63,045/Month",₹1.1 Crores
4,3 BHK Apartment For Sale In Laa Royal Manor ...,"Laa Royal Manor 11th Cross Rd, 8th cross, HAL...","2,110 sqft",₹1.58 Lacs/Month,₹2.75 Crores
5,2 BHK Flat For Sale In Pallava Terrace In Ja...,"17, Pallava Terrace, North Main Road, 6th Bloc...","1,065 sqft","₹42,985/Month",₹75 Lacs
6,4+ BHK In Independent House For Sale In Raja...,"Independent House, 6th C cross 3rd main rd nea...","2,200 sqft","₹77,374/Month",₹1.35 Crores
7,"3 BHK Apartment For Sale In Admiralty Manor,...","Admiralty Manor, Indiranagar Admiralty Manor,...","1,960 sqft","₹85,971/Month",₹1.5 Crores
8,2 BHK Apartment For Sale In Jains Prakriti I...,"Jains Prakriti Kanakapura Rd, 7th Block West...","1,298 sqft",₹1.15 Lacs/Month,₹2 Crores
9,3 BHK Flat For Sale In Benaka Apartments In ...,"16th D main, HAL 2nd stage, Indiranagar , Ben...","1,331 sqft","₹48,717/Month",₹85 Lacs
10,4 BHK In Independent House For Sale In Indir...,"Independent House, 2nd stage ,9th cross","2,550 sqft",₹1.69 Lacs/Month,₹2.95 Crores
11,2 BHK Apartment For Sale In Blueberry Apartm...,"Blueberry Apartment 13th E Main Rd, Channakes...","1,074 sqft","₹87,691/Month",₹1.53 Crores
12,4+ BHK In Independent House For Sale In Laks...,"Independent House, CMH Rd , Near B P Bakery","2,250 sqft","₹63,045/Month",₹1.1 Crores
13,2 BHK Apartment For Sale In Tarang Parkway A...,"Tarang Parkway Apartment 2nd Main Rd, Shivana...","1,200 sqft","₹57,314/Month",₹1 Crore
14,3 BHK Apartment For Sale In Brigade Gateway ...,"Brigade Gateway Dr Rajkumar Road, Rajaji Naga...","1,640 sqft",₹1.5 Lacs/Month,₹2.62 Crores
15,"2 BHK Flat For Sale In Jains Prakruti, Jayan...","Kanakapura Road, Jayanagar, Bangalore, Karnata...","1,301 sqft","₹85,971/Month",₹1.5 Crores
16,4+ BHK In Independent House For Sale In Raja...,"Independent House, 6th Cross Rd, 2nd Block ne...","2,240 sqft","₹83,679/Month",₹1.46 Crores
17,3 BHK Flat For Sale In Rajaji Nagar,"Independent House, 242, 27th cross, 2nd Block,...","1,275 sqft","₹77,374/Month",₹1.35 Crores
18,3 BHK Apartment For Sale In Adarsh Court Apa...,Adarsh Court Apartment Adarsh Court Apartment...,"1,990 sqft",₹1.86 Lacs/Month,₹3.25 Crores
19,3 BHK Apartment For Sale In Parasmani Regenc...,"Parasmani Regency Parasmani Regency, 8th Cros...","1,940 sqft",₹1.43 Lacs/Month,₹2.5 Crores
20,2 BHK Flat For Sale In Kumar Ashraya Apartme...,"Kumar Ashraya Apartments 194, 9th Cross Rd 2n...",900 sqft,"₹37,827/Month",₹66 Lacs
21,3 BHK Apartment For Sale In Mayitri Enclave ...,"Mayitri Enclave Mayitri Enclave, 39th C, 5T B...","1,450 sqft","₹44,705/Month",₹78 Lacs
22,2 BHK Flat For Sale In Jayanagar Residency I...,"Jayanagar Residency, K V Layout, LIC Colony, J...","1,200 sqft","₹57,314/Month",₹1 Crore
23,4 BHK Flat For Sale In Rrbc Piccassso In Jay...,"Municipal No.152, 18th main road, beside Sai B...","4,859 sqft",₹3.91 Lacs/Month,₹6.83 Crores
24,4 BHK Flat For Sale In Phoenix One Bangalor...,"Dr Rajkumar Rd, opposite Sheraton Hotel, Rajaj...","2,901 sqft",₹2.72 Lacs/Month,₹4.75 Crores

# Question 9 Answer --> scraping mentioned details from dineout.co.in -- Restaurant name, Cuisine, Location, Ratings, Image URL

In [162]:
# importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
dineout = requests.get("https://www.dineout.co.in/delhi-restaurants/buffet-special")
dineout

In [ ]:
soup13 = BeautifulSoup(dineout.content)
soup13

In [ ]:
table13 = soup13.find_all('div',class_="content")
table13

In [ ]:
resturantname = []

for i in table13[0].find_all('a',class_="restnt-name ellipsis"):
    resturantname.append(i.text)

resturantname

In [ ]:
cuisine = []

for i in table13[0].find_all('span',class_="double-line-ellipsis"):
    cuisine.append(i.text)
    
cuisine

In [ ]:
location = []

for i in table13[0].find_all('div',class_='restnt-loc ellipsis'):
    location.append(i.text)
    
location

In [ ]:
ratingsm = []

for i in table13[0].find_all('div',class_="restnt-rating rating-4"):
    ratingsm.append(i.text)
    
ratingsm

In [ ]:
imgurl = []

for i in table13[0].find_all('img',class_="no-img"):
    imgurl.append(i['data-src'])
    
imgurl

In [ ]:
# printing length

print(len(resturantname),len(cuisine),len(location),len(ratingsm),len(imgurl))

In [172]:
# making dataframe

dineoutdetails = pd.DataFrame({'Restaurant name':resturantname,'Cuisine':cuisine,'Location':location,'Ratings':ratingsm,'Image URL':imgurl})
dineoutdetails

,Restaurant name,Cuisine,Location,Ratings,Image URL
0,Castle Barbeque,"₹ 2,000 for 2 (approx) | North Indian, Chinese","Connaught Place, Central Delhi",3.5,https://im1.dineout.co.in/images/uploads/resta...
1,Jungle Jamboree,"₹ 1,400 for 2 (approx) | North Indian, Asian, ...","3CS Mall,Lajpat Nagar - 3, South Delhi",3.9,https://im1.dineout.co.in/images/uploads/resta...
2,Castle Barbeque,"₹ 2,000 for 2 (approx) | Chinese, North Indian","Pacific Mall,Tagore Garden, West Delhi",3.9,https://im1.dineout.co.in/images/uploads/resta...
3,Cafe Knosh,"₹ 3,000 for 2 (approx) | Italian, Continental","The Leela Ambience Convention Hotel,Shahdara, ...",4.3,https://im1.dineout.co.in/images/uploads/resta...
4,The Barbeque Company,"₹ 1,700 for 2 (approx) | North Indian, Chinese","Gardens Galleria,Sector 38A, Noida",4,https://im1.dineout.co.in/images/uploads/resta...
5,India Grill,"₹ 2,400 for 2 (approx) | North Indian, Italian","Hilton Garden Inn,Saket, South Delhi",3.9,https://im1.dineout.co.in/images/uploads/resta...
6,Delhi Barbeque,"₹ 1,800 for 2 (approx) | North Indian","Taurus Sarovar Portico,Mahipalpur, South Delhi",3.7,https://im1.dineout.co.in/images/uploads/resta...
7,The Monarch - Bar Be Que Village,"₹ 1,900 for 2 (approx) | North Indian","Indirapuram Habitat Centre,Indirapuram, Ghaziabad",3.8,https://im1.dineout.co.in/images/uploads/resta...
8,World Cafe,"₹ 2,400 for 2 (approx) | North Indian, Italian","Vibe by The Lalit Traveller,Sector 35, Faridabad",4.2,https://im1.dineout.co.in/images/uploads/resta...
9,Indian Grill Room,"₹ 2,200 for 2 (approx) | North Indian, Mughlai","Suncity Business Tower,Golf Course Road, Gurgaon",4.3,https://im1.dineout.co.in/images/uploads/resta...
10,Mad 4 Bar B Que,₹ 800 for 2 (approx) | North Indian,"Sector 29, Faridabad",3.6,https://im1.dineout.co.in/images/uploads/resta...
11,Barbeque 29,"₹ 1,500 for 2 (approx) | North Indian, Mughlai...","NIT, Faridabad",4.2,https://im1.dineout.co.in/images/uploads/resta...
12,Glasshouse,"₹ 3,400 for 2 (approx) | European, Italian, As...","DoubleTree By Hilton Gurugram Baani Square,Sec...",4,https://im1.dineout.co.in/images/uploads/resta...

# Question 10 Answer --> scraping first 10 product details which include product name , price , Image URL from bewakoof

In [173]:
#importing required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [ ]:
# getting url
bewakoof = requests.get("https://www.bewakoof.com/women-t-shirts?sort=new")
bewakoof

In [ ]:
soup14 = BeautifulSoup(bewakoof.content)
soup14

In [ ]:
table14 = soup14.find_all('div',class_="categoryGridWrapper clearfix")
table14

In [ ]:
productname1 = []

for i in table14[0].find_all('h3'):
    productname1.append(i.text)
    
productname1

In [ ]:
price1 = []

for i in table14[0].find_all('span',class_="discountedPriceText"):
    price1.append(i.text)
    
price1

In [ ]:
imageurl1=[]

for i in table14[0].find_all('img',class_="productImgTag"):
    imageurl1.append(i['src'])
    
imageurl1

In [ ]:
# printing length
print(len(productname1),len(price1),len(imageurl1))

In [181]:
# Making Data Frame 
bewakoofdetails = pd.DataFrame({'Product Name':productname1,'Price':price1,'Image Url':imageurl1})
bewakoofdetails

,Product Name,Price,Image Url
0,Women's Black Tropical Vibes Typography Oversi...,₹ 349,https://images.bewakoof.com/t320/tropical-vibe...
1,Women's Black This World is Rotten Graphic Pri...,₹ 599,https://images.bewakoof.com/t320/women-s-black...
2,Women's White Zenitsu Graphic Printed Oversize...,₹ 599,https://images.bewakoof.com/t320/women-s-white...
3,Women's Black Unless You are Korean Typography...,₹ 599,https://images.bewakoof.com/t320/women-s-black...
4,Women's White This World is Rotten Graphic Pri...,₹ 599,https://images.bewakoof.com/t320/women-s-white...
5,Women's Black Zenitsu Graphic Printed Oversize...,₹ 599,https://images.bewakoof.com/t320/women-s-black...
6,Women's Black One Piece Graphic Printed Oversi...,₹ 599,https://images.bewakoof.com/t320/women-s-black...
7,Women's White One Piece Graphic Printed Oversi...,₹ 599,https://images.bewakoof.com/t320/women-s-white...
8,Women's Black Rocklee Graphic Printed Oversize...,₹ 599,https://images.bewakoof.com/t320/women-s-black...
9,Women's White Taxi Graphic Printed Oversized T...,₹ 599,https://images.bewakoof.com/t320/women-s-white...